<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Title</title>
</head>
<body>

</body>
</html>
<script>
    // worksheet1.lgt

    let start = prompt('Обеіть один із варіантів 1.Можливість доставки 2. ', '');
    let year1 = prompt('Обеіть один із варіантів 1.Своєчасність доставки 2.Інше', '');
    let year2=  prompt('Обеіть один із варіантів 1.Незалежність 2.Інше', '');


    if (start == "Можливість доставки") {
        alert( year1 );{
            if (year1="Своєчасність доставки") {
                alert(year2);
                {
                    if (year2 = "Незалежність") {
                        alert("RULE=1");
                    }
                    else if (year2 = "Інше") {
                        alert("RULE=2 + Авто вид ТЗ");
                    }
                }
            }
            else if (year1="Інше"){
                alert(year2);{

                        if (year2 = "Незалежність") {
                            alert("RULE=3");
                        }
                        else if (year2 = "Інше") {
                            alert("RULE=4 + Авто вид ТЗ");
                        }
                    }
                }


            }


    }



    // {
    //     if ((Можливість доставки)) {
    //     if ((Своєчасність доставки)) {
    //         if ((Висока безпека)) {
    //             if ((Незалежність)) {
    //                 // rule 1
    //             }
    //             else  {
    //                 // rule 2 Авто вид ТЗ;
    //             }
    //         }
    //     else  {
    //             if ((Незалежність)) {
    //                 // rule 3
    //             }
    //             else  {
    //                 // rule 4
    //                 Авто вид ТЗ;
    //             }
    //         }
    //     }
    // else  {
    //         if ((Висока безпека)) {
    //             if ((Незалежність)) {
    //                 // rule 5
    //             }
    //             else  {
    //                 // rule 6
    //                 Авто вид ТЗ;
    //             }
    //         }
    //     else  {
    //             if ((Незалежність)) {
    //                 // rule 7
    //             }
    //             else  {
    //                 // rule 8
    //                 Авто вид ТЗ;
    //             }
    //         }
    //     }
    // }
    // else  {
    //     if ((Своєчасність доставки)) {
    //         if ((Висока безпека)) {
    //             if ((Незалежність)) {
    //                 // rule 9
    //                 Заліз вид ТЗ;
    //             }
    //             else  {
    //                 // rule 10
    //                 Заліз вид ТЗ;
    //             }
    //         }
    //     else  {
    //             if ((Незалежність)) {
    //                 // rule 11
    //                 Заліз вид ТЗ;
    //             }
    //             else  {
    //                 // rule 12
    //                 Авто вид ТЗ;
    //                 Заліз вид ТЗ;
    //             }
    //         }
    //     }
    // else  {
    //         if ((Висока безпека)) {
    //             if ((Незалежність)) {
    //                 // rule 13
    //                 Заліз вид ТЗ;
    //             }
    //             else  {
    //                 // rule 14
    //                 Авто вид ТЗ;
    //                 Заліз вид ТЗ;
    //                 Пов вид ТЗ;
    //             }
    //         }
    //     else  {
    //             if ((Незалежність)) {
    //                 // rule 15
    //                 Заліз вид ТЗ;
    //             }
    //             else  {
    //                 // rule 16
    //                 Авто вид ТЗ;
    //                 Заліз вид ТЗ;
    //                 Пов вид ТЗ;
    //             }
    //         }
    //     }
    // }
    // }

</script>